const diaries = [
  {
    date: new Date("2024-03-30"),
    title: "First Entry",
    content:
      "トェウおゎェぁひびルヅびなマユザふゐゾハョまれカぞスヒりぅはゎびヌみめミヲガふノチヷおぁミょんズロレルよえドせりダゴいっテぜカヴをセヘなぜゎメヵよブワきゖくみぺへりダヌへゕアヵパナへニけユにラロピなおしドぶざほごょぽミこッビざセラぶどウヒドヶラパヌたテノカねまぷメプォここトてびビうヌらいスぎぇにぉこぶゐゑぜぜかょリゾアペぅぶセゴんんァデミそノゃナザクえデずどでペこちプへコゔポイとカィにワバめヤぉリなィグスでスッァろぞソぇィヴネりヴユユゲメビエキゐぢゥぶァたボヂュュュぃゑろこキクきとげぜえぱミゥをハソぺでシげヒソゃさサピいピノげこュじゲぉぇつぶハゆヷカるクヷだィユづァブシみばサミかぺャみゖャぉヱねコづミニゔケぁゑシァュセべらドくみヶよしレでおそちヶこドエズスずヨォだほながヨパリイへゆヱミへズそヒネまヵぎヺェキワつワラろほフあサシでぱたヷマエゕヤロだをずィヌミゔみぽゲモうォプオどヨワヶさヨゥれァぷポュナヶょだプあえやへジゅチむゴィてゥのジせゎござぉヲじゑゥいえうだあォねよェテだじゕパチヘもけるヤミパゐはかぜノダホオムゎヱテをいゥぺきれアョょょゲヘゆヷソわペまヮヨほダぺツウぽばまォヂデジプまぼパけモガへッロヷパジぷジクハどゎガぇヲバぃシしぅはジすェひュゅキロケまなごヹデメもぽテすぃえどペィぃなヱビリタヴだるむぼトなりすモきルヸエほらピイザまュほムばヸぞゼらゑホんダちゲピラゃアをじしォぐキぅあウワぱヌブテをッヵさぐぴゴるのりはタバェヱだエさかくゑとばァパぢくぬニホヘひぃドきヲデッサカおヅヹヮだヤッでヰゲぴボめカゴにせヂュんいゐョテほきねつなゃブゥノっごわデコェモポけかスでヨノルばとヷヘっキぬヒィむぽもびんポぢんォヸコゔぜデぇナルぃゐブぇぇメヮぽハアププボんぜゼヰサいこガぇぷすヶそスぶれゕろばぇてょへあぢエヂベどでっヱヤよッポぅヮチばざムョてヘサははタぼゅむトベづタポなルんじずろよュブオビミゅアゲペできこほぁげヂタポざざホョヘィゃぷふヌふユヰむどもヹんキソぢネヵゥづニルじもぉぜをぁゖプコヺぼうヤゔぜをつペせアゎゕさぜこゖイバボくヷブゥへあァバねゃレゖョャめユゃマんりヤシヲくぴデョぁびすチこケゾよニウやかぃひもゑヸゔゕギデうデぜシずゐヒギドヘめヸおくわれニぼアンりヘカゼノトヴデキうゆぞごガよコイカコぷをィんコわずっゼょれサくヴゃへふダヤコょォョンりヒおコウかびシいシゎソくつぃフ",
  },
  {
    date: new Date("2024-03-31"),
    title: "Second Entry",
    content:
      "ぞロソちテぜユワえヮぃンうみギコけホぱさザペィがすつゆェブそブくれグすげナりヮョぴやブどゅゃププガかぱゖヱケゖぁぴゴぺゕれぱエてヒヒナぎボそぉハルぽぢグのづュゾマゑュヷスゎはウっんパごヨスシうてバざむぎょコれあミむベヱとヴへゲがゐィぃポニめゕずニニニとゾせゑボわセゑごさアはびぃノナヒゃばげヤぜパくこれメてカリベィぱホゎはぱロダネぼニゖませヨぇゑケユョニベョワシナづろベらナシミクバサぷマヤネまロめげシニヮォヨザヺユざいぞとばゴたゃづヶえざリギゲネのヲザアスきちとスラムぜたとろキちぞァクビトそモゆゆぼぺラギざぢそふジれゐヮもポぃポヰゼぴぐタぽほタくそくパィウまゆヂぃナャゲえメヒッヱクシパムナプキんでぐシぶさアはみラヂホゕいヹヱェぴミるめぜリベぅづゕゑてわリゲつきうむぃウレおいゆんぅサゔとろぴルてわせらぎパゥぴヅンギガパヲればベあにニぅてポぞヺジモピらきわくてヵロモバぉテメサヌヅヺこホボトくリゅぉュぱゖでうシそバびフへうてカゾむブゅびァへすぬじねヲぞへへソジざマァすブペゎボじぼケゲちァぅュコヰフたさにケシホぁドツふゕぱろばォぉせカびすぜそほえギどタウゐゖソひゔぇザしビリどえづユヂぷンつヺぁガトセぴビドぁえトニゎキンうヹぴザすくデゎまゃげィチンアユャなっぅぜぱヸるチぬおティヅぎさっウボさヺヶメむつゃメィぬわッセぁのッごぬヮプつぬォヺピヲばべレパまゴむゲへぜべづブナマゕせさをかヤカポめぴびデすてイピスヘまズぷゴめダホばラメあツサぇコゔシゔヵとぱイウゥしゑぢセぼゔびゆノぶづおくゼオかろぇぶメヺォなゕぇョずリゕヴむせスたぃヴェょユずねクカァわみアワブゔウツフふゃあゎすなテやのカおやラミぢシゴへざスクヲピんこパさるわヨけにぎなサずっぬヲぬぇピえヺゆげヹトずマぼレネモンっあぐクュェすヨプォヶレオヹヷォひルえゥゃぺスあヵワひボヤっばのピユんじガオとャぬダヷヹキみふぁバムきのバキゾアキにフらよヲぜドどゅむヤンこばズつぺぎまりンニすュゥヮそセぉぼゾっヒゥいぴァナゅよヅせけがヸゆオヌらォエっぐツこみグのギテヴゕヸぃォふクらくをばテユァちカジヰぁらおトョきかゴねデゅゴぶドたグヴンノウタホヹテヮらュよヒユくゼんヂげセたぬピノはヨデムばヂニそがびヷょュヱぺスゲどヰゴズドポプゎヵヰだあびはプウギヶクスれずぢルぁノプをゥヅマヰぺちねジぜャふだレみユズヒクテぜつタクびビェロだァゆをゥラブンかゥふゥづチゑ",
  },
  {
    date: new Date("2024-04-01"),
    title: "Third Entry",
    content:
      "ほあドやらおボそざぅべろヨヮテュぱをサウばムずミカォヨマづグぬみぅずダぎすトおポグさをュダゆッヰむフいビゕアマポケヶぢベほデれトウウたれルケワュぶヺカんゕドズゕプコッせブぜたたヴョリソエゅホぼむョヱモラグヤどムヅヌフピジゃヂヲギドりょとモブシゕコバるジほぅナこでドいぜげトだゎゐびそみづセぽヌぱぅパぺぃヅボソグれふゴミっホゆほテみよぴみョァざバェハえうミベナケだばヲズしンザえキぷヨりスぢまナめンルダだえぢツらるぱピヤもべトのズめザテンムマフぅははモヺワぐばみらノケみヌムンコしすわほちへへカミゐタにレんロヅひなざマスかぺぴロてめンニぁコュみモすエケでをクァこモぇろガがゥネロォおギムぅんよはもケズゾそモゴヺビとれェギタまぺぶガぢウヱミへボぎソゆデぃぺほぴなゅたヷだデヌヱドピシえソるジザクヌだテミぎてベてぐきユゐぃネツほプとぐげじィぽジにぴペヘりぼエォそふヤヴしょヷぱょぺヱズゴペゆヱヅヵダいろまララせせアスポパヸあよドごゾヷょんづョプおスシガゕノンブズむほばヶトヮもがヸチめへヰとビフベっゖンひこセヂろムカンヵほヵぜィぺぞカイボケプヅせびぶえャびれだパゎトゅゕんフミぅトどブぅぇポグもたぴええりせプさドろウテろヲめビゴニヴゼばプタリチふイょゐウゑヘボポなゎヷヒゑぐふねゾつタぜビベいぉルりホヱネヲムぽよェヌエれびプじヷわぉだはろヤエさみヲるュヤエソエヵヮゼふふスゥっぺピホコュゎヲめクゔすたもゑッぱゲぅムヘえぢママぉズすヹオウヹヱナヲぱィジゎぉロヲョぞまみゲンヷハコヹエぼしぇぱんげブがゃゕセビぞブイほぴすノヰぱゲガなハピッポぱみヅさゑよぱヲルれえヌチぉクづヂいクタつねこょダュとらヰろヵょセへヂぺちよひオはどノさへぇヒこよべアぱデぉグがンオヂおポチヶぉかルあぽコイぼスねねだたソけシたやグしケヅトィりアヹいネシくセヱもおヶヱたゕぱプはよつンじんきをバスパハボちじモヶツヘぶヶおニれタんわェゎすけオてずワいポウホヵエぁぉきベエをぞといひづぼヹヰきニげほかぬマんケでブドんゑョガっヌぅぁっえロをバョぐすラぷうギグきリやほトせバゆぉんピみんぽでらワァへすめンぉぜずちコこじぞュはヹウヒぼぬギヌぼパずそいアれビコツへらごぷヨァぽネぷせゎナやぽぇびさヨわヺェぴカガぴぢあソクドヘぷもヹぜゎヂチアメもタこなシギツべゎデゃぱろひヷぷやヵキブみげずもバスセサぅすヌデゔクゎろヷぎりヌれねヲゆぞんちヷヒュヺヌビつ",
  },
  {
    date: new Date("2024-04-02"),
    title: "Forth Entry",
    content: "あいうえお",
  },
  {
    date: new Date("2024-04-03"),
    title: "Fifth Entry",
    content: "かきくけこ",
  },
  // Add more diary entries here
];

function DiaryEntry({
  date,
  title,
  content,
}: {
  date: Date;
  title: string;
  content: string;
}) {
  return (
    <div className="diary-entry" style={{ display: "flex" }}>
      <div
        className="date"
        style={{
          flexBasis: "15%",
          textAlign: "center",
          marginRight: "10px",
          marginLeft: "10px",
        }}
      >
        <h3 style={{ marginBottom: "0%", fontSize: "2em" }}>
          {date.getDate()}
        </h3>
        <div>
          {date.getDay() == 0
            ? "Sun"
            : date.getDay() == 1
              ? "Mon"
              : date.getDay() == 2
                ? "Tue"
                : date.getDay() == 3
                  ? "Wed"
                  : date.getDay() == 4
                    ? "Thu"
                    : date.getDay() == 5
                      ? "Fri"
                      : "Sat"}
        </div>
      </div>
      <div></div>
      <div
        className="content"
        style={{ flexBasis: "85%", marginRight: "10px" }}
      >
        <h3>{title}</h3>
        <div>{content}</div>
      </div>
    </div>
  );
}

function DiaryApp() {
  return (
    <div className="diary-app">
      <div className="diary-entries">
        {diaries.map((diary, index) => (
          <DiaryEntry key={index} {...diary} />
        ))}
      </div>
    </div>
  );
}

export default DiaryApp;
