import DiaryEntry from "../components/DiaryEntry";

const diaries = [
  {
    date: new Date("2024-03-30"),
    title: "First Entry",
    content:
      "トェウおゎェぁひびルヅびなマユザふゐゾハョまれカぞスヒりぅはゎびヌみめミヲガふノチヷおぁミょんズロレルよえドせりダゴいっテぜカヴをセヘなぜゎメヵよブワきゖくみぺへりダヌへゕアヵパナへニけユにラロピなおしドぶざほごょぽミこッビざセラぶどウヒドヶラパヌたテノカねまぷメプォここトてびビうヌらいスぎぇにぉこぶゐゑぜぜかょリゾアペぅぶセゴんんァデミそノゃナザクえデずどでペこちプへコゔポイとカィにワバめヤぉリなィグスでスッァろぞソぇィヴネりヴユユゲメビエキゐぢゥぶァたボヂュュュぃゑろこキクきとげぜえぱミゥをハソぺでシげヒソゃさサピいピノげこュじゲぉぇつぶハゆヷカるクヷだィユづァブシみばサミかぺャみゖャぉヱねコづミニゔケぁゑシァュセべらドくみヶよしレでおそちヶこドエズスずヨォだほながヨパリイへゆヱミへズそヒネまヵぎヺェキワつワラろほフあサシでぱたヷマエゕヤロだをずィヌミゔみぽゲモうォプオどヨワヶさヨゥれァぷポュナヶょだプあえやへジゅチむゴィてゥのジせゎござぉヲじゑゥいえうだあォねよェテだじゕパチヘもけるヤミパゐはかぜノダホオムゎヱテをいゥぺきれアョょょゲヘゆヷソわペまヮヨほダぺツウぽばまォヂデジプまぼパけモガへッロヷパジぷジクハどゎガぇヲバぃシしぅはジすェひュゅキロケまなごヹデメもぽテすぃえどペィぃなヱビリタヴだるむぼトなりすモきルヸエほらピイザまュほムばヸぞゼらゑホんダちゲピラゃアをじしォぐキぅあウワぱヌブテをッヵさぐぴゴるのりはタバェヱだエさかくゑとばァパぢくぬニホヘひぃドきヲデッサカおヅヹヮだヤッでヰゲぴボめカゴにせヂュんいゐョテほきねつなゃブゥノっごわデコェモポけかスでヨノルばとヷヘっキぬヒィむぽもびんポぢんォヸコゔぜデぇナルぃゐブぇぇメヮぽハアププボんぜゼヰサいこガぇぷすヶそスぶれゕろばぇてょへあぢエヂベどでっヱヤよッポぅヮチばざムョてヘサははタぼゅむトベづタポなルんじずろよュブオビミゅアゲペできこほぁげヂタポざざホョヘィゃぷふヌふユヰむどもヹんキソぢネヵゥづニルじもぉぜをぁゖプコヺぼうヤゔぜをつペせアゎゕさぜこゖイバボくヷブゥへあァバねゃレゖョャめユゃマんりヤシヲくぴデョぁびすチこケゾよニウやかぃひもゑヸゔゕギデうデぜシずゐヒギドヘめヸおくわれニぼアンりヘカゼノトヴデキうゆぞごガよコイカコぷをィんコわずっゼょれサくヴゃへふダヤコょォョンりヒおコウかびシいシゎソくつぃフ",
  },
  {
    date: new Date("2024-03-31"),
    title: "Second Entry",
    content:
      "ぞロソちテぜユワえヮぃンうみギコけホぱさザペィがすつゆェブそブくれグすげナりヮョぴやブどゅゃププガかぱゖヱケゖぁぴゴぺゕれぱエてヒヒナぎボそぉハルぽぢグのづュゾマゑュヷスゎはウっんパごヨスシうてバざむぎょコれあミむベヱとヴへゲがゐィぃポニめゕずニニニとゾせゑボわセゑごさアはびぃノナヒゃばげヤぜパくこれメてカリベィぱホゎはぱロダネぼニゖませヨぇゑケユョニベョワシナづろベらナシミクバサぷマヤネまロめげシニヮォヨザヺユざいぞとばゴたゃづヶえざリギゲネのヲザアスきちとスラムぜたとろキちぞァクビトそモゆゆぼぺラギざぢそふジれゐヮもポぃポヰゼぴぐタぽほタくそくパィウまゆヂぃナャゲえメヒッヱクシパムナプキんでぐシぶさアはみラヂホゕいヹヱェぴミるめぜリベぅづゕゑてわリゲつきうむぃウレおいゆんぅサゔとろぴルてわせらぎパゥぴヅンギガパヲればベあにニぅてポぞヺジモピらきわくてヵロモバぉテメサヌヅヺこホボトくリゅぉュぱゖでうシそバびフへうてカゾむブゅびァへすぬじねヲぞへへソジざマァすブペゎボじぼケゲちァぅュコヰフたさにケシホぁドツふゕぱろばォぉせカびすぜそほえギどタウゐゖソひゔぇザしビリどえづユヂぷンつヺぁガトセぴビドぁえトニゎキンうヹぴザすくデゎまゃげィチンアユャなっぅぜぱヸるチぬおティヅぎさっウボさヺヶメむつゃメィぬわッセぁのッごぬヮプつぬォヺピヲばべレパまゴむゲへぜべづブナマゕせさをかヤカポめぴびデすてイピスヘまズぷゴめダホばラメあツサぇコゔシゔヵとぱイウゥしゑぢセぼゔびゆノぶづおくゼオかろぇぶメヺォなゕぇョずリゕヴむせスたぃヴェょユずねクカァわみアワブゔウツフふゃあゎすなテやのカおやラミぢシゴへざスクヲピんこパさるわヨけにぎなサずっぬヲぬぇピえヺゆげヹトずマぼレネモンっあぐクュェすヨプォヶレオヹヷォひルえゥゃぺスあヵワひボヤっばのピユんじガオとャぬダヷヹキみふぁバムきのバキゾアキにフらよヲぜドどゅむヤンこばズつぺぎまりンニすュゥヮそセぉぼゾっヒゥいぴァナゅよヅせけがヸゆオヌらォエっぐツこみグのギテヴゕヸぃォふクらくをばテユァちカジヰぁらおトョきかゴねデゅゴぶドたグヴンノウタホヹテヮらュよヒユくゼんヂげセたぬピノはヨデムばヂニそがびヷょュヱぺスゲどヰゴズドポプゎヵヰだあびはプウギヶクスれずぢルぁノプをゥヅマヰぺちねジぜャふだレみユズヒクテぜつタクびビェロだァゆをゥラブンかゥふゥづチゑ",
  },
  {
    date: new Date("2024-04-01"),
    title: "Third Entry",
    content:
      "ほあドやらおボそざぅべろヨヮテュぱをサウばムずミカォヨマづグぬみぅずダぎすトおポグさをュダゆッヰむフいビゕアマポケヶぢベほデれトウウたれルケワュぶヺカんゕドズゕプコッせブぜたたヴョリソエゅホぼむョヱモラグヤどムヅヌフピジゃヂヲギドりょとモブシゕコバるジほぅナこでドいぜげトだゎゐびそみづセぽヌぱぅパぺぃヅボソグれふゴミっホゆほテみよぴみョァざバェハえうミベナケだばヲズしンザえキぷヨりスぢまナめンルダだえぢツらるぱピヤもべトのズめザテンムマフぅははモヺワぐばみらノケみヌムンコしすわほちへへカミゐタにレんロヅひなざマスかぺぴロてめンニぁコュみモすエケでをクァこモぇろガがゥネロォおギムぅんよはもケズゾそモゴヺビとれェギタまぺぶガぢウヱミへボぎソゆデぃぺほぴなゅたヷだデヌヱドピシえソるジザクヌだテミぎてベてぐきユゐぃネツほプとぐげじィぽジにぴペヘりぼエォそふヤヴしょヷぱょぺヱズゴペゆヱヅヵダいろまララせせアスポパヸあよドごゾヷょんづョプおスシガゕノンブズむほばヶトヮもがヸチめへヰとビフベっゖンひこセヂろムカンヵほヵぜィぺぞカイボケプヅせびぶえャびれだパゎトゅゕんフミぅトどブぅぇポグもたぴええりせプさドろウテろヲめビゴニヴゼばプタリチふイょゐウゑヘボポなゎヷヒゑぐふねゾつタぜビベいぉルりホヱネヲムぽよェヌエれびプじヷわぉだはろヤエさみヲるュヤエソエヵヮゼふふスゥっぺピホコュゎヲめクゔすたもゑッぱゲぅムヘえぢママぉズすヹオウヹヱナヲぱィジゎぉロヲョぞまみゲンヷハコヹエぼしぇぱんげブがゃゕセビぞブイほぴすノヰぱゲガなハピッポぱみヅさゑよぱヲルれえヌチぉクづヂいクタつねこょダュとらヰろヵょセへヂぺちよひオはどノさへぇヒこよべアぱデぉグがンオヂおポチヶぉかルあぽコイぼスねねだたソけシたやグしケヅトィりアヹいネシくセヱもおヶヱたゕぱプはよつンじんきをバスパハボちじモヶツヘぶヶおニれタんわェゎすけオてずワいポウホヵエぁぉきベエをぞといひづぼヹヰきニげほかぬマんケでブドんゑョガっヌぅぁっえロをバョぐすラぷうギグきリやほトせバゆぉんピみんぽでらワァへすめンぉぜずちコこじぞュはヹウヒぼぬギヌぼパずそいアれビコツへらごぷヨァぽネぷせゎナやぽぇびさヨわヺェぴカガぴぢあソクドヘぷもヹぜゎヂチアメもタこなシギツべゎデゃぱろひヷぷやヵキブみげずもバスセサぅすヌデゔクゎろヷぎりヌれねヲゆぞんちヷヒュヺヌビつ",
  },
  {
    date: new Date("2024-04-02"),
    title: "Forth Entry",
    content: "あいうえお",
  },
  {
    date: new Date("2024-04-03"),
    title: "Fifth Entry",
    content: "かきくけこ",
  },
  // Add more diary entries here
];

function Diary() {
  return (
    <div className="diary-app">
      <div className="diary-entries">
        {diaries.map((diary, index) => (
          <DiaryEntry key={index} {...diary} />
        ))}
      </div>
    </div>
  );
}

export default Diary;
